Old Simulations/rhoCentralFoamSim/rhoCentralFoamSim/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101300;

boundaryField
{
   inlet
    {
        type            fixedValue;
        value           uniform 3447378.647;
    }

    freestream
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.14;
        fieldInf        101300;
        lInf            1;
        value           uniform 101300;
    }
	

    walls
    {
        type            zeroGradient;
    }

    bottomEmptyFaces
    {
        type            empty;
    }

    topEmptyFaces
    {
        type            empty;
    }
}



// ************************************************************************* //
